In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
#시리즈 데이터셋을 구성한다.
s = Series(['kim', 'lee', 'park'])
s

0     kim
1     lee
2    park
dtype: object

In [5]:
s.values

array(['kim', 'lee', 'park'], dtype=object)

### 실습예제 1
'BMW', 'Nissan', 'Honda', 'Audi'를 값으로 갖고 'one', 'two', 'three', 'four'를 인덱스로 갖는 시리즈 데이터 셋을 선언하시오

In [11]:
s = Series(['BMW', 'Nissan', 'Honda', 'Audi'], index=['one','two','three', 'four'])
s

one         BMW
two      Nissan
three     Honda
four       Audi
dtype: object

In [13]:
s['four']

'Audi'

### 실습예제 2
'BMW':15000, 'Nissan':8000, 'Honda':8000, 'Audi':10000를 사전(dictionary)으로 선언하고 해당 사전을 이용하여 시리즈 데이터셋을 선언하시오

In [15]:
dic = {'BMW':15000, 'Nissan':8000, 'Honda':8000, 'Audi':10000}
s = Series(dic)
s

Audi      10000
BMW       15000
Honda      8000
Nissan     8000
dtype: int64

### 실습예제 3
'name': ['Aaron Brooks', 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'],
        'height': [180, 210, 187.5, 200],
        'weight': [72.45, 120.6, 86.85, 105.75]
        
인 사전을 이용하여 tFrame이란 이름을 가진 데이터프레임을 만드시오

In [37]:
sdata = {'name': ['Aaron Brooks', 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'],
        'height': [180, 210, 187.5, 200],
        'weight': [72.45, 120.6, 86.85, 105.75]}
tFrame = DataFrame(sdata)
tFrame

   height             name  weight
0   180.0     Aaron Brooks   72.45
1   210.0  Brendan Haywood  120.60
2   187.5      Cory Joseph   86.85
3   200.0    Darius Miller  105.75

### 실습예제 4
인덱스를 'one', 'two', 'three', 'four'로 재정의 하시오

In [38]:
aFrame = DataFrame(sdata, index = ['one', 'two', 'three', 'four'])
aFrame

       height             name  weight
one     180.0     Aaron Brooks   72.45
two     210.0  Brendan Haywood  120.60
three   187.5      Cory Joseph   86.85
four    200.0    Darius Miller  105.75

### 실습예제 5
컬럼의 순서를 name, height, weight순으로 변경하시오

In [44]:
aFrame = DataFrame(sdata, columns = ['name', 'height', 'weight'], index = ['one', 'two', 'three', 'four'])
aFrame

                  name  height  weight
one       Aaron Brooks   180.0   72.45
two    Brendan Haywood   210.0  120.60
three      Cory Joseph   187.5   86.85
four     Darius Miller   200.0  105.75

In [40]:
tFrame.columns

Index(['height', 'name', 'weight'], dtype='object')

In [41]:
tFrame['name']

0       Aaron Brooks
1    Brendan Haywood
2        Cory Joseph
3      Darius Miller
Name: name, dtype: object

In [45]:
aFrame.ix['one']

C:\Users\samsung\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

name      Aaron Brooks
height             180
weight           72.45
Name: one, dtype: object

In [48]:
aFrame['debt'] = 16.5
aFrame

                  name  height  weight  debt
one       Aaron Brooks   180.0   72.45  16.5
two    Brendan Haywood   210.0  120.60  16.5
three      Cory Joseph   187.5   86.85  16.5
four     Darius Miller   200.0  105.75  16.5

In [64]:
tFrame['key'] = tFrame.height>=200
tFrame

   height             name  weight    key
0   180.0     Aaron Brooks   72.45  False
1   210.0  Brendan Haywood  120.60   True
2   187.5      Cory Joseph   86.85  False
3   200.0    Darius Miller  105.75   True

In [65]:
del tFrame['key']
tFrame.columns
tFrame

   height             name  weight
0   180.0     Aaron Brooks   72.45
1   210.0  Brendan Haywood  120.60
2   187.5      Cory Joseph   86.85
3   200.0    Darius Miller  105.75

In [70]:
frame = DataFrame(np.arange(9).reshape(3,3), index = ['a','b','c'])
frame

   0  1  2
a  0  1  2
b  3  4  5
c  6  7  8

In [72]:
frame2 = frame.reindex(['a','b','c','d','e'])
frame2

     0    1    2
a  0.0  1.0  2.0
b  3.0  4.0  5.0
c  6.0  7.0  8.0
d  NaN  NaN  NaN
e  NaN  NaN  NaN

In [80]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [77]:
#axis=1있어야함
data.drop('two', axis = 1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [83]:
data.drop(['two', 'four'], axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [85]:
tFrame.columns

Index(['height', 'name', 'weight'], dtype='object')

In [90]:
tFrame

   height             name  weight
0   180.0     Aaron Brooks   72.45
1   210.0  Brendan Haywood  120.60
2   187.5      Cory Joseph   86.85
3   200.0    Darius Miller  105.75

In [98]:
tFrame.drop([0])

   height             name  weight
1   210.0  Brendan Haywood  120.60
2   187.5      Cory Joseph   86.85
3   200.0    Darius Miller  105.75

In [102]:
tFrame = tFrame.drop(['name'], axis = 1)

In [104]:
tFrame

   height  weight
0   180.0   72.45
1   210.0  120.60
2   187.5   86.85
3   200.0  105.75

In [105]:
#del함수는 삭제하면 원본에서 삭제
#drop함수는 복사본에서 삭제

### 실습예제 13
인덱스가 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'이고 컬럼(열)이 'one', 'two', 'three', 'four', 'five'인 3x5 데이터프레임을 만드시오(이름은 sample으로 하고, 값은 0부터 차례대로 채우시오)

In [112]:
sample = DataFrame(np.arange(15).reshape((3,5)), 
                   columns = [ 'one', 'two', 'three', 'four', 'five'] ,
                   index = [ 'Brendan Haywood', 'Cory Joseph', 'Darius Miller'])

sample

                 one  two  three  four  five
Brendan Haywood    0    1      2     3     4
Cory Joseph        5    6      7     8     9
Darius Miller     10   11     12    13    14

In [115]:
sample[sample['four']>=5]

               one  two  three  four  five
Cory Joseph      5    6      7     8     9
Darius Miller   10   11     12    13    14

In [118]:
sample[1:3]

               one  two  three  four  five
Cory Joseph      5    6      7     8     9
Darius Miller   10   11     12    13    14

In [123]:
sample[['one', 'five']]

                 one  five
Brendan Haywood    0     4
Cory Joseph        5     9
Darius Miller     10    14

In [125]:
sample['one']

Brendan Haywood     0
Cory Joseph         5
Darius Miller      10
Name: one, dtype: int32

In [126]:
sample[['one']]

                 one
Brendan Haywood    0
Cory Joseph        5
Darius Miller     10

In [141]:
sample.ix[sample.five==9, :3]

             one  two  three
Cory Joseph    5    6      7

In [131]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [133]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [135]:
# columns값이 같지 않으면 더하기 되어 Nan으로 표시
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [138]:
f = lambda x : x.max() - x.min()
# lambda 함수
# def f(x): return x.max()-x.min()

In [142]:
mean = lambda x : sum(x)/len(x)
sample.apply(mean)

one      5.0
two      6.0
three    7.0
four     8.0
five     9.0
dtype: float64